// 1 TASK //////////////////////////////////////////////////////////////////////////////////////////

// idk how to do this ＞︿＜

// 2 TASK //////////////////////////////////////////////////////////////////////////////////////////

// let a = Number(prompt('Введіть розмір першої сторони трикутника'));
// let b = Number(prompt('Введіть розмір другої сторони трикутника'));
// let c = Number(prompt('Введіть розмір третьої сторони трикутника'));

// if ((a+b>c) && (a+c>b) && (c+b>a)) {
//     alert('Трикутник існує');
//     if ((a*a+b*b>c*c) && (b*b+c*c>a*a) && (a*a+c*c>b*b)) {
//         alert('Трикутник гострокутний');
//     } else {
//         alert('Трикутник тупокутний');
//     }
// } else {
//     alert('Трикутника не існує');
// };

// 3 TASK //////////////////////////////////////////////////////////////////////////////////////////

// let getFour = Number(prompt('Введіть 4-х значне число'));
// let arr = (""+getFour).split("").map(Number);

// if ((arr[0] + arr[1]) == (arr[2] + arr[3])) {
//     alert('Сума перших 2х чисел співпадає з сумаю 2х останніх');
// } else {
//     alert('Сума перших 2х чисел не співпадає з сумаю 2х останніх');
// }

// console.log(arr);

// 4 TASK //////////////////////////////////////////////////////////////////////////////////////////

// idk how to do this ＞︿＜

// 5 TASK //////////////////////////////////////////////////////////////////////////////////////////

// let arr = [123,45,1000,5555,234,11];
// let allert = false;
// let find = Number(prompt('Введіть значення для пошуку в масиві'));
// for (let i = 0; i < arr.length; i++) {
//     if (find == arr[i]) {
//         allert = true;
//         alert(`Ваше значення є в масиві під номером: ${arr.indexOf(arr[i])+1}`);
//     };
// };
// if (allert != true) {
//     for (let i = 0; i < arr.length; i++) {
//         if (find != arr[i]) {
//             alert(`Вашого значення нема в масиві`);
//             break;
//         };
//     };
// };

// 6 TASK //////////////////////////////////////////////////////////////////////////////////////////

// idk how to do this ＞︿＜

// 7 TASK //////////////////////////////////////////////////////////////////////////////////////////

// idk how to do this ＞︿＜

// 8 TASK //////////////////////////////////////////////////////////////////////////////////////////

// let arr = [1, 2, 3, 43, 54, 2, 5, 43, 111, 2];
// let uniqueArr = removeDuplicates(arr);

// function removeDuplicates(arr) {
//     let unique = [];
//     let checked = [];

//     for (let i = 0; i < arr.length; i++) {
//         if (!checked.includes(arr[i])) {
//             unique.push(arr[i]);
//             checked.push(arr[i]);
//         };
//     };

//     return unique;
// };

// console.log(uniqueArr);
// alert(`К-ть унікальних чисел списка - ${uniqueArr.length}`);